import { Point } from "../components/PointCard";

export interface SlugStaticContent {
    link: string;
    title: string;
    subtitle: string;
    content: string;
}

export const STATIC_CONTENT = [
    {
        title: '',
        content: `רוח של למידה, העמקה והרחבת אופקים פעמה בלבו של אמיר, חברנו לצוות. יכולת נדירה לגרום למתבונן להביט על המציאות מזווית נוספת. כל סקירה גאוגרפית שהתבצעה בסוף ניווט או מסע מפרך ,אשר אמורה הייתה להיות לא יותר מחיבור הנקודות שבשטח אל המפה, הפכה בידיו של אמיר להזדמנות ללמידה עמוקה ומיוחדת. הוא שאב ממעיין הידע וחדוות הסקרנות שלו, גירה את החשיבה שלנו והגיש למתבונן פרספקטיבה שונה וייחודית. כל פריט בנוף היה עבורו פתח להרחבות היסטוריות, גאולוגיות, תרבותיות – ומה לא?”
אמיר צור, קצין לוחם ופרמדיק בסיירת מטכ”ל, מהראשונים להתייצב ולהילחם מול מחבלי הנוח'בה שחדרו לקיבוץ כפר עזה ב-7.10.23.
אמיר, אדם ברוך כישרונות, איש רוח ואיש משפחה, אדם מחונן, נגן פסנתר, אלוף הארץ בריצת ניווט, איש טבע ומדריך טיולים, פרמדיק, קצין ולוחם נחוש ומוערך – ובעיקר חבר, כזה שנגע בלב של כל אחד מאתנו.
`
    },
    {
        title: 'שלא נצא בורים',
        content: `ביטוי שהיווה פתיח קבוע לכל סקירה מעשירה של אמיר, אשר ניתנה בכל הזדמנות: אחרי מסע מפרך, בתצפית אחרי עליה ארוכה, בתחילת שבוע חדש, ואפילו על דלת השירותים.
בכל פעם מחדש, אמיר מצא דרך להרחיב את אופקינו, להפתיע בידע חדש, ולתת לנו רגע של מחשבה והשראה.
מתוך הרוח הזו נולד הפרויקט – להמשיך את הדרך שאמיר התווה - לעורר את הסקרנות, האהבה לטבע ולארץ והרצון להעמיק את ההתבוננות בפרטים שבשגרה חולפים לנגד עיננו מבלי כל התייחסות.
לאורך הארץ פרושות נקודות ציון שבכל אחת מהן ישנו זיכרון משותף שלנו עם אמיר. בכל אחת מהן יקום רוג’ום צנוע, שמוטמע בו קוד לסריקה.
סריקת הקוד תוביל אתכם לאתר אינטרנט עשיר בסיפורים, במידע ובהשראה על המקום שבו אתם עומדים, על הדרך שאמיר עבר ועל ערכיו.
כמו אז, גם היום, אמיר ממשיך לקחת אותנו איתו – לגלות, להתבונן, לשאול שאלות ולצאת קצת פחות בורים ממה שהיינו.
`
    },
    {
        title: `בצילך ולאורך חבר.`,
        content: ``
    },

];

export const SLUG_STATIC_CONTENT: SlugStaticContent[] = [
    {
        link: 'gaash',
        title: 'המחנה הגדול (געש) - בצל אמיר',
        subtitle: 'תיירים / יהודה עמיחי',
        content: `
פעם ישבתי על מדרגות ליד שער במצודת דוד, את שני הסלים הכבדים שמתי לידי.
עמדה שם קבוצת תיירים סביב המדריך ושימשתי להם נקודת ציון - "אתם רואים את האיש הזה עם הסלים? קצת ימינה מראשו נמצאת קשת מהתקופה הרומית".
אמרתי בליבי - הגאולה תבוא רק אם יגידו להם: "אתם רואים שם את הקשת הרומית? לא חשוב, אבל לידה, קצת שמאלה ולמטה ממנה, יושב אדם שקנה ירקות ופירות לביתו"

את הקטע הזה, מצאנו בתיקיית החינוך של אמיר מהמסלול, תיקייה אותה מילא, בתור אחראי החינוך של הצוות, בתכנים ערכיים, מעשירים ומלמדים ושממנה בחר בקפידה בכל פעם קטע או שניים והעביר אותם לנו בדרך כזו או אחרת - תלייה בשירותים, סקירה גאוגרפית בסוף מסע, ערב טד צוותי או בכל הזדמנות שמצא לנכון.
לאמיר הייתה את הרגישות הזו לאדם, אליה משווע יהודה עמיחי בשירו, הרגישות ששמה לב לאדם בתוך כל התפאורה. שמה לב לחבר לצוות ולא ל"תלק" הניווט לידו הוא עומד, כשם שיהודה עמיחי היה רוצה שמדריך הטיולים בשיר ישים לב אליו ולא לקשת הרומית שלצידה הוא יושב. היו לו לאמיר את הקשב וההתבוננות, לראות את החבר שלצידו. בתוך כל מסיחי הדעת והעומס בשירות הצבאי, לעצור ולשאול "מה איתך?", בהתעניינות וסקרנות אמיתית, מהלב. לראות את הבן אדם, את החבר שלצידו.
הקשב הגבוה והסקרנות לא נעצרו שם, היה לו מבט על המציאות, שמסתכל על הדברים קצת אחרת, מכיוון לא מצופה ובעיקר, מקשיב למציאות שסביבו. לפניי ניווט, כשכולם מסתכלים על המדבר שלפנינו ומנסים להיזכר ולשנן את המקטעים הראשונים בסיפור הדרך, אמיר רואה את הזבל שנזרק על הכביש ליד, הולך ומרים אותו. כשכולם עסוקים ועמוסים בשגרה היחידתית, אמיר רואה ולא יכול להתעלם מהכאב והאתגרים בחברה הישראלית, מחפש ומוצא את דרכו להשפיע, גם בזמן השירות הצבאי. ובשבוע מתגלגל, כשהולכים עם 50 אחוז משקל גוף על הגב, והמבט של כולם באדמה, אמיר מסתכל למעלה, לצדדים, על הזוחל שמתגנב מתחת לסלע, על הצמח בצד השביל וכמובן על האדם שלצידו. מה איתו? איך הוא מרגיש? מה המחשבות שלו? הרי הוא אדם, הרבה לפניי שהפך להיות חייל.
הנקודה בה בחרנו להקים את הרוג'ום הראשון הינה המחנה הגדול, פינת חמד תחת עצי האקליפטוס בסמוך לקיבוץ געש אשר הוקמה ותוחזקה במשך שנים רבות על ידי יוסי שורר ותלמידי בית הספר "אדם וסביבה". המרחב משמש מגוון פעילויות של טבע, חינוך ויצירה עבור מסגרות חינוכיות ומשפחתיות בגעש ובסביבה.
מה איתכם? במה אתם מתבוננים כשאתם כאן? במחנה הגדול - בצל אמיר? מה תופס את הקשב שלכם? מה מעורר בכם סקרנות? האם משהו גורם לכם להרגיש התפעמות? או התרגשות? כשאתם מסתכלים על בריכת החורף הזו, הצמודה, או על חורשת האקליפטוס, מה אתם רואים? האם אלו הציפורים שתופסות את עיניכם? או אולי ראשני החפרית המצויה, השוחים במים? ומה עם השרף על גזע האקליפטוס? והעלים? אלו שעל העץ ואלו שעל הקרקע. ומה עם בתי הקיבוץ, תהיתם מי הקים אותם? ומתי? מהו סיפור חייהם?
כל אדם מתבונן אחרת. אחד מביט רחוק אל ההרים והשני רואה קרוב, את החיפושית שעוברת בין רגליו. וכל התבוננות טובה, העיקר, כמו שלימד אותנו אמיר בחייו - להתבונן, להסתקרן, לחפש את העומק של הדברים. להתבונן בעצמך פנימה ומשם לצאת החוצה ולהתבונן בטבע שסביבך, ובתוכו, והכי חשוב, באדם שלצידך.

בצילך ולאורך חבר.

        `
    }
]

export const EXTERNAL_LINKS = [
    {
        title: 'כמה דברים על אמיר מפיה של עופרי אחותו.',
        description: 'ראיון בכאן 11',
        link: 'https://x.com/kann_news/status/1746545317355348117'
    },
    {
        title: 'פרידה מעילוי, הקצין שתמיד היה ראשון, גם בלהסתער',
        description: 'כתבה בכאן 11',
        link: 'https://www.youtube.com/watch?v=DeiPPqIS-A0'
    },
    {
        title: 'בלוג שכתב אמיר במהלך האליפות הראשנה שלו באירופה',
        description: 'EYOC - European Youth Orienteering Championships',
        link: 'https://amirzur-o.blogspot.com/2016/12/eyoc-european-youth-orienteering.html?m=1'
    },
    {
        title: 'פודקסט על הלחימה בכפר עזה, יחד עם כפיר, אחד הלוחמים בכוח.',
        description: 'חמש אצבעות',
        link: 'https://www.youtube.com/watch?v=bPEV95KlDM8'
    },
    {
        title: 'דף ההנצחה של אמיר.',
        description: 'יזכור - אתר ההנצחה הלאומי',
        link: 'https://www.izkor.gov.il/%D7%90%D7%9E%D7%99%D7%A8%20%D7%A6%D7%95%D7%A8/en_2f2ff74b1b7545cb0b1e671c038c512a'
    },
    {
        title: '33 עצות לחיים טובים.',
        description: 'אמיר צור',
        link: 'https://s3.eu-central-1.amazonaws.com/dav.externalfiles.new/tikshoretmada/33+%D7%A2%D7%A6%D7%95%D7%AA+%D7%9C%D7%97%D7%99%D7%99%D7%9D+%D7%98%D7%95%D7%91%D7%99%D7%9D+%D7%A9%D7%9C+%D7%90.+%D7%A6%D7%95%D7%A8+(1)+(2).pdf'
    },
    {
        title: 'שיחה מלב אל לב עם עופרי ואיתן, אחיו של אמיר.',
        description: 'ראיון עם חנוך דאום ורותם סלע',
        link: 'https://www.facebook.com/watch/?share_url=https%3A%2F%2Fwww.facebook.com%2Fshare%2Fv%2FY9u9brjLmgMAzzXJ%2F&v=2471067606427734&rdid=LvVhE3Neg3qmKbZN'
    },
    {
        title: 'הלוחם האמיץ עם הלב הגדול.',
        description: 'ynet',
        link: 'https://www.ynet.co.il/environment-science/article/rk002muazr?utm_source=ynet.app.android&utm_medium=social&utm_campaign=whatsapp&utm_term=rk002muazr&utm_content=Header'
    },
];

export const POINTS: Point[] = [
    {
        title: 'המחנה הגדול - געש',
        link: '/gaash',
        location: {
            lat: '32.2337946',
            long: '34.8259390'
        },
        disabled: false
    },
    {
        title: 'ערד - מצפה מואב',
        link: '/arad',
        location: {
            lat: '31.2586',
            long: '35.2172'
        },
        disabled: true
    },
    {
        title: 'הר החרמון',
        link: '/hermon',
        location: {
            lat: '33.3090',
            long: '35.7667'
        },
        disabled: true
    },
    {
        title: 'הר עמשא',
        link: '/amasa',
        location: {
            lat: '31.3578',
            long: '35.1106'
        },
        disabled: true
    },
    {
        title: 'מצפה הימים',
        link: '/mitzpe-hayamim',
        location: {
            lat: '32.9531',
            long: '35.4942'
        },
        disabled: true
    },
    {
        title: 'הר קטום',
        link: '/katom',
        location: {
            lat: '30.9631',
            long: '35.2872'
        },
        disabled: true
    },
    {
        title: 'גב ימין',
        link: '/giv-yamin',
        location: {
            lat: '30.6467',
            long: '35.2067'
        },
        disabled: true
    },
    {
        title: 'נהר הירדן',
        link: '/jordan-river',
        location: {
            lat: '32.5976',
            long: '35.5733'
        },
        disabled: true
    },
    {
        title: 'מצפה שלם',
        link: '/shalem',
        location: {
            lat: '31.5617',
            long: '35.3881'
        },
        disabled: true
    },
    {
        title: 'מדרשת בן גוריון',
        link: '/ben-gurion',
        location: {
            lat: '30.8531',
            long: '34.7833'
        },
        disabled: true
    },
    {
        title: 'חוף גינוסר',
        link: '/ginossar',
        location: {
            lat: '32.8706',
            long: '35.5192'
        },
        disabled: true
    },
    {
        title: 'הר עצמון',
        link: '/atzmon',
        location: {
            lat: '32.8056',
            long: '35.2556'
        },
        disabled: true
    },
    {
        title: 'הר אביטל',
        link: '/avital',
        location: {
            lat: '33.1208',
            long: '35.7781'
        },
        disabled: true
    },
    {
        title: 'תל חדיד',
        link: '/hadid',
        location: {
            lat: '31.9731',
            long: '34.9342'
        },
        disabled: true
    },
    {
        title: 'נביא מוסא',
        link: '/nabi-musa',
        location: {
            lat: '31.8125',
            long: '35.4000'
        },
        disabled: true
    },
    {
        title: 'חרבת קצרה',
        link: '/katzra',
        location: {
            lat: '30.7997',
            long: '35.2467'
        },
        disabled: true
    },
]; 